# MUltiple regression

In [4]:
import pandas as pd

In [5]:
dataset=pd.read_excel('marks.xlsx')

In [6]:
dataset

    name  college id  duration  marks  time before college  caff semester
0   abhi           1         2     40                   10   100    first
1   eric           1         4     50                   20   200   second
2   jack           1         2      5                    5   400    third
3   amit           1         2     50                   10    10    first
4  krish           1         4     60                   20   100   second

In [7]:
#if lots of data is there we find them by using head for top  5data
dataset.head()

    name  college id  duration  marks  time before college  caff semester
0   abhi           1         2     40                   10   100    first
1   eric           1         4     50                   20   200   second
2   jack           1         2      5                    5   400    third
3   amit           1         2     50                   10    10    first
4  krish           1         4     60                   20   100   second

# Feature Engineering

In [8]:
sem=dataset['semester']
sem

0     first
1    second
2     third
3     first
4    second
Name: semester, dtype: object

In [9]:
# NOw  WE USE DUMMY

In [10]:
sem_dummies=pd.get_dummies(sem)
sem_dummies

   first  second  third
0      1       0      0
1      0       1      0
2      0       0      1
3      1       0      0
4      0       1      0

In [11]:
final_sem=sem_dummies.iloc[:,0:2]
final_sem

   first  second
0      1       0
1      0       1
2      0       0
3      1       0
4      0       1

In [12]:
dataset.columns

Index(['name', 'college id', 'duration', 'marks', 'time before college',
       'caff', 'semester'],
      dtype='object')

In [13]:
dataset=dataset[['college id','duration','marks','time before college','caff']]
#dataset

In [14]:
dataset.head()

   college id  duration  marks  time before college  caff
0           1         2     40                   10   100
1           1         4     50                   20   200
2           1         2      5                    5   400
3           1         2     50                   10    10
4           1         4     60                   20   100

In [15]:
dataset[['first','second']]=final_sem

C:\Users\my\anaconda3\lib\site-packages\pandas\core\frame.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

In [16]:
dataset.head()

   college id  duration  marks  time before college  caff  first  second
0           1         2     40                   10   100      1       0
1           1         4     50                   20   200      0       1
2           1         2      5                    5   400      0       0
3           1         2     50                   10    10      1       0
4           1         4     60                   20   100      0       1

# Feature Extraction

In [17]:
# Filter method

In [20]:
# Correlation.
dataset.corr()

,college id,duration,marks,time before college,caff,first,second
college id,NaN,NaN,NaN,NaN,NaN,NaN,NaN
duration,NaN,1.000000,0.599145,0.952579,-0.073488,-0.666667,1.000000
marks,NaN,0.599145,1.000000,0.803685,-0.842077,0.171184,0.599145
time before college,NaN,0.952579,0.803685,1.000000,-0.357518,-0.408248,0.952579
caff,NaN,-0.073488,-0.842077,-0.357518,1.000000,-0.655271,-0.073488
first,NaN,-0.666667,0.171184,-0.408248,-0.655271,1.000000,-0.666667
second,NaN,1.000000,0.599145,0.952579,-0.073488,-0.666667,1.000000

In [21]:
# variance Threshold(for constant variable)
# for this we have to create a model

In [32]:
from sklearn.feature_selection import VarianceThreshold
s=VarianceThreshold(threshold=0)
s.fit(dataset)

VarianceThreshold(threshold=0)

In [23]:
s.get_support()

array([False,  True,  True,  True,  True,  True,  True])

# Embeded Method

In [24]:
# coefficient
y=dataset['marks']
y

0    40
1    50
2     5
3    50
4    60
Name: marks, dtype: int64

In [25]:
x=dataset[['duration','time before college','caff', 'first','second']]
x

   duration  time before college  caff  first  second
0         2                   10   100      1       0
1         4                   20   200      0       1
2         2                    5   400      0       0
3         2                   10    10      1       0
4         4                   20   100      0       1

In [26]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [27]:
weight=model.coef_
weight

array([ 1.88078749,  1.27032916, -0.10497238, -2.5671154 ,  0.94039374])

# L2 Regularization or lasso

In [29]:

from sklearn.linear_model import Lasso
from sklearn.feature_selection import SelectFromModel

In [30]:
sel=SelectFromModel(Lasso(alpha=0.01))# here alpha because the data is to less it predict on huge data thus alpha comes.
sel.fit(x,y)

C:\Users\my\anaconda3\lib\site-packages\sklearn\linear_model\_coordinate_descent.py:476: ConvergenceWarning: Objective did not converge. You might want to increase the number of iterations. Duality gap: 0.3840460180501954, tolerance: 0.182
  positive)

SelectFromModel(estimator=Lasso(alpha=0.01, copy_X=True, fit_intercept=True,
                                max_iter=1000, normalize=False, positive=False,
                                precompute=False, random_state=None,
                                selection='cyclic', tol=0.0001,
                                warm_start=False),
                max_features=None, norm_order=1, prefit=False, threshold=None)

In [31]:
sel.get_support()

array([ True,  True,  True,  True, False])